# StartNode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..StartNode Property
MEPAnalyticalSegment Class See Also
---
The id of the start analytical node.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int StartNode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartNode As Integer
	Get
```

Visual C++
---
```text
public:
property int StartNode {
	int get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace